<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Задание1</title>
    <style>
        body {
            font-size: 20px;
            font-family: Arial, Helvetica, sans-serif;
        }
    </style>

</head>

<body>
    <h1>Привет </h1>

    <!--   Добейтесь корректной работы вашего сервера. Тщательно повторите шаги, которые мы делали на уроке. В случае затруднений - обращайтесь в чат поддержки!
Добавьте себе в закладки официальный мануал по языку http://fi2.php.net/manual/ru/
В PHP есть функция var_dump($something), которая выводит подробную информацию о значениях и их типах. Попробуйте написать что-нибудь вроде var_dump(2*2); чтобы увидеть, как она работает. Изучите с помощью этой функции следующие выражения:
3 / 1
1 / 3
'20cats' + 40
18 % 4 (прочтите главу http://fi2.php.net/manual/ru/language.operators.arithmetic.php чтобы узнать, что это такое)
Говорят, что в PHP "всё является выражением". Интересно, что даже присваивание переменной какого-либо значения тоже является выражением! Изучите примеры ниже и дайте ответ - что же является значением выражения присваивания?
echo ($a = 2);
$x = ($y = 12) - 8; echo $x;
В PHP имеется логический (boolean) тип, имеющий два значения - true (истина) и false (ложь). Изучите с помощью var_dump() следующие выражения и объясните их (прочитайте предварительно http://fi2.php.net/manual/ru/language.operators.comparison.php ):
1 == 1.0
1 === 1.0
'02' == 2
'02' === 2
'02' == '2'
* 
$x = true xor true;
var_dump($x);
Попробуйте объяснить результат.
 -->

    <?php
    echo '<pre>';
    var_dump(3 / 1); /* тип int целочисленный */
    var_dump(1 / 3); /* тип float число с плавающей точкой или дробное число */
    var_dump('20cats' + 40); /* ошибка т.к даже несмотря что при сложение строковый тип данных преобразовывается в числовой и вначале есть цифры,
в нем есть строковые символы  результат NaN - not a number*/
    var_dump(18 % 4); /* тип int целочисленный */

    /* что же является значением выражения присваивания? 
        является присвоенное значение*/
    echo ($a = 2);
    $x = ($y = 12) - 8;
    echo $x;
    var_dump(1 == 1.0); /* true без равенства типизации */
    var_dump(1 === 1.0); /* false с строгим равенством типизации */
    var_dump('02' == 2); /* true строка преобразуется в число + без равенства типизации */
    var_dump('02' === 2); /* false строка преобразуется в число + с строгим равенством типизации */
    var_dump('02' == '2'); /* true строка преобразуется в число + без равенства типизации */
    $x = true xor true; /* у оператора = выше приоритет, чем у XOR. Из-за этого результат xor теряется */
    var_dump($x);
    echo '</pre>';
    ?>
</body>

</html>